---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AssemblyMemberDifferentType
source: html/dc11e47c-bbe0-421b-b82f-b7676a51beaa.htm
---
# AssemblyMemberDifferentType Members

Specifies whether the .NET object represents a valid Revit entity.